NeatoScan/Get_Data/xml_files/book_listings.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <RequestListingsReport xmlns="http://api.neatoscan.com/">
            <username></username>
            <token></token>
            <startDate></startDate>
            <endDate></endDate>
        </RequestListingsReport>
    </soap:Body>
</soap:Envelope>